[
    {
        "name": "Silvery Barbs",
        "level": "1",
        "classes": ["Bard", "Sorcerer", "Wizard"],
        "school": "Enchantment",
        "duration": "Instantaneous",
        "range": "60 feet",
        "components": ["V"],
        "material": "",
        "ritual": false,
        "concentration": false,
        "desc": ["You magically distract the triggering creature and turn its momentary uncertainty into encouragement for another creature.","The triggering creature must reroll the d20 and use the lower roll.","You can then choose a different creature you can see within range (you can choose yourself). The chosen creature has advantage on the next attack roll, ability check, or saving throw it takes within the next 1 minute.","A creature can be empowered by only one use of this spell at a time."],
        "higher_level": [],
        "spellid": "silvery-barbs",
        "cast_time": ["1 reaction", "which you take when a creature you can see within 60 feet of yourself succeeds on an attack roll, an ability check, or a saving throw"],
        "source": ["Strixhaven: a Curriculum of Chaos"]
    },{
        "name": "Borrowed Knowledge",
        "level": "2",
        "classes": ["Bard", "Cleric", "Warlock", "Wizard"],
        "subclasses": ["Sorcerer (Divine Soul)"],
        "school": "Divination",
        "duration": "1 hour",
        "range": "Self",
        "components": ["V", "S", "M"],
        "material": "a book worth at least 25 gp",
        "ritual": false,
        "concentration": false,
        "desc": ["You draw on knowledge from spirits of the past. Choose one skill in which you lack proficiency.","For the spell's duration, you have proficiency in the chosen skill.","The spell ends early if you cast it again."],
        "higher_level": [],
        "spellid": "borrowed-knowledge",
        "cast_time": "1 action",
        "source": ["Strixhaven: a Curriculum of Chaos"]
    },{
        "name": "Kinetic Jaunt",
        "level": "2",
        "classes": ["Artificer", "Bard", "Sorcerer", "Wizard"],
        "school": "Transmutation",
        "duration": "up to 1 minute",
        "range": "Self",
        "components": ["S"],
        "material": "",
        "ritual": false,
        "concentration": true,
        "desc": ["You magically empower your movement with dance-like steps, giving yourself the following benefits for the duration:","Your walking speed increases by 10 feet.","You don't provoke opportunity attacks.","You can move through the space of another creature, and it doesn't count as difficult terrain. If you end your turn in another creatures space, you are shunted to the last unoccupied space you occupied, and you take 1d8 force damage."],
        "higher_level": [],
        "spellid": "kinetic-jaunt",
        "cast_time": "1 bonus action",
        "source": ["Strixhaven: a Curriculum of Chaos"]
    },{
        "name": "Vortex Warp",
        "level": "2",
        "classes": ["Artificer", "Sorcerer", "Wizard"],
        "school": "Conjuration",
        "duration": "Instantaneous",
        "range": "90 feet",
        "components": ["V","S"],
        "material": "",
        "ritual": false,
        "concentration": false,
        "desc": ["You magically twist space around another creature you can see within range.","The target must succeed on a Constitution saving throw (the target can choose to fail), or the target is teleported to an unoccupied space of your choice that you can see within range.","The chosen space must be on a surface or in a liquid that can support the target without the target having to squeeze."],
        "higher_level": ["When you cast this spell using a spell slot of 3rd or higher, the range of the spell increases by 30 feet for each slot level above 2nd."],
        "spellid": "vortex-warp",
        "cast_time": "1 action",
        "source": ["Strixhaven: a Curriculum of Chaos"]
    },{
        "name": "Wither and Bloom",
        "level": "2",
        "classes": ["Druid", "Sorcerer", "Wizard"],
        "school": "Necromancy",
        "duration": "Instantaneous",
        "range": "60 feet",
        "components": ["V", "S", "M"],
        "material": "a withered vine twisted into a loop",
        "ritual": false,
        "concentration": false,
        "desc": ["You invoke both death and life upon a 10-foot-radius sphere centered on a point within range.","Each creature of your choice in that area must make a Constitution saving throw, taking 2d6 necrotic damage on a failed save, or half as much on a successful one. Nonmagical vegetation in that area withers.","In addition, one creature of your choice in that area can spend one roll of its unspent Hit Dice and regain a number of hit points equal to the roll plus your spellcasting ability modifier."],
        "higher_level": ["When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d6 for each slot above 2nd, and the number of Hit Dice that can be spent and added to the healing roll increases by one for each slot above 2nd."],
        "spellid": "wither-and-bloom",
        "cast_time": "1 action",
        "source": ["Strixhaven: a Curriculum of Chaos"]
    }
]